tap "drud/ddev"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "michaeleisel/zld"
tap "pantheon-systems/external"
tap "shivammathur/php"
tap "sidneys/homebrew"
# Library for manipulating PNG images
brew "libpng"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Extract files from Microsoft cabinet files
brew "cabextract"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Dependency Manager for PHP
brew "composer"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Generic library support script
brew "libtool"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Manage compile and link flags for libraries
brew "pkg-config"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Post-modern modal text editor
brew "helix"
# Website copier/offline browser
brew "httrack"
# Configurable static site generator
brew "hugo"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Portable Foreign Function Interface library
brew "libffi", link: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Image processing and image analysis library
brew "leptonica"
# NaCl networking and cryptography library
brew "libsodium"
# Text-based web browser
brew "lynx"
# Utility for directing compilation
brew "make"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Framework for layout and rendering of i18n text
brew "pango"
# Small collection of programs that operate on patch files
brew "patchutils"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Cross-platform application and UI framework
brew "qt"
# Cross-platform application and UI framework
brew "qt@5"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Build, bundle & ship your Rust WASM application to the web
brew "trunk"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# JavaScript package manager
brew "yarn"
# DDEV
brew "drud/ddev/ddev"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# General-purpose scripting language
brew "shivammathur/php/php@8.1", link: true
# Offline NT Password Editor
brew "sidneys/homebrew/chntpw"
# GPU-accelerated terminal emulator
cask "alacritty"
# Open-source keystroke visualiser
cask "keycastr"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "andrewdavidblum.drupal-smart-snippets"
vscode "benjaminbenais.copilot-theme"
vscode "bmewburn.vscode-intelephense-client"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dionmunk.vscode-notes"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "glavin001.unibeautify-vscode"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jannisx11.batch-rename-extension"
vscode "johnpapa.vscode-peacock"
vscode "jozefchmelar.compare"
vscode "kakumei.php-xdebug"
vscode "marcostazi.vs-code-drupal"
vscode "mblode.twig-language-2"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "mohd-akram.vscode-html-format"
vscode "mohsen1.prettify-json"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "neilbrayfield.php-docblocker"
vscode "ofhumanbondage.react-proptypes-intellisense"
vscode "paulober.pico-w-go"
vscode "pflannery.vscode-versionlens"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "svelte.svelte-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "whatwedo.twig"
vscode "wix.vscode-import-cost"
vscode "xdebug.php-debug"
