tap "ddev/ddev"
tap "koekeishiya/formulae"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Tool to analyze file system usage written in Rust
brew "dutree"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# NCurses Disk Usage
brew "ncdu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# DDEV
brew "ddev/ddev/ddev"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"

# Password manager that keeps all passwords secure behind one password
cask "1password@7"
# AI Coding Agent IDE
cask "antigravity"
# Online gaming platform
cask "battle-net"
# 3D creation suite
cask "blender"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Software custom-built for content creation
cask "elgato-wave-link"
# Collaborative team software
cask "figma"
# Font with programming ligatures and glyphs
cask "font-fira-code-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Game development engine
cask "godot"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Utility to hide menu bar items
cask "hiddenbar"
# File archiver
cask "keka"
# Open-source keystroke visualiser
cask "keycastr"
# Optimise your webcam, headset, and Logi Dock for video meetings
#TODO: Requires manual installation. `open /opt/homebrew-cask/Caskroom/logitune/.../LogiTuneInstaller.dmg`
cask "logitune"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama-app"
# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# PDF reader and note-taking application
cask "skim"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Configurator of compatible keyboards in real time
cask "vial"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Native desktop client for WhatsApp
cask "whatsapp"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"

vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "andrewdavidblum.drupal-smart-snippets"
vscode "benjaminbenais.copilot-theme"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "glavin001.unibeautify-vscode"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jannisx11.batch-rename-extension"
vscode "johnpapa.vscode-peacock"
vscode "kakumei.php-xdebug"
vscode "marcostazi.vs-code-drupal"
vscode "mblode.twig-language-2"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mohd-akram.vscode-html-format"
vscode "mohsen1.prettify-json"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "mtbdata.vscode-phpsab-docker"
vscode "neilbrayfield.php-docblocker"
vscode "ofhumanbondage.react-proptypes-intellisense"
vscode "pflannery.vscode-versionlens"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "stanislav.vscode-drupal"
vscode "unifiedjs.vscode-mdx"
vscode "valeryanm.vscode-phpsab"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "whatwedo.twig"
vscode "wix.vscode-import-cost"
vscode "xdebug.php-debug"
vscode "zobo.php-intellisense"

# Install from App Store
# [Amphetamine](https://apps.apple.com/es/app/amphetamine/id937984704)
# [DaisyDisk](https://apps.apple.com/us/app/daisydisk/id411643860)
