andrewdavidblum.drupal-smart-snippets
bmewburn.vscode-intelephense-client
denoland.vscode-deno
dbaeumer.vscode-eslint
docker.docker
eamodio.gitlens
edwinhuish.better-comments-next
esbenp.prettier-vscode
github.vscode-pull-request-github
mblode.twig-language
mblode.twig-language-2
mikestead.dotenv
mhutchie.git-graph
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cpptools
mtbdata.vscode-phpsab-docker
nadim-vscode.twig-code-snippets
neilbrayfield.php-docblocker
platformio.platformio-ide
stanislav.vscode-drupal
tomoki1207.pdf
xdebug.php-debug
